Revit 2027 API
Document.Delete Method
Overload List
Name | Description
Delete(ElementId) |  Deletes an element from the document given the id of that element.
Delete(ICollection<ElementId>) |  Deletes a set of elements from the document.
Top
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace